import time
t0 = time.time()
print("load wisper ", time.ctime())

from faster_whisper import WhisperModel

model_size = "large-v3"

# Run on GPU with FP16
#model = WhisperModel(model_size, device="cuda", compute_type="float16")

# or run on GPU with INT8
# model = WhisperModel(model_size, device="cuda", compute_type="int8_float16")

# or run on CPU with INT8
model = WhisperModel(model_size, device="cpu", compute_type="int8")

segments, info = model.transcribe(".\Мельница - Поверь.mp3", beam_size=5)

print("Detected language '%s' with probability %f" % (info.language, info.language_probability))

t1 = time.time()
print("begin ", time.ctime())
for segment in segments:
    print("[%.2fs -> %.2fs] %s" % (segment.start, segment.end, segment.text))
print("finish ", time.ctime(), " ", time.time() - t0)


'''
load wisper  Thu Jun 18 18:03:46 2026
Detected language 'ru' with probability 0.996179
begin  Thu Jun 18 18:04:07 2026
[0.00s -> 10.00s]  Небо
[30.00s -> 36.88s]  А к полуночи будет от полной луны горячо
[36.88s -> 43.84s]  Там на чёрных холмах чёрный твой виноград
[43.84s -> 49.76s]  Прорастает рядами драконьих зубов
[49.76s -> 57.00s]  У бесценных рядов аргонавты не спят
[57.00s -> 59.98s]  Загревают лозунг на небе
[59.98s -> 65.02s]  А к полуночи драконьим дыханием костров
[65.02s -> 69.72s]  Дым не ворон, дым не воздух
[69.72s -> 74.40s]  Величиною в стулах смотрят звёзды
[74.40s -> 78.92s]  Верхнего мира и горы стальные
[78.92s -> 84.76s]  Рогатые шлемы, веера боевые во тьме
[84.76s -> 89.82s]  Под рукой внука и броня
[89.82s -> 89.96s]  А к полуночи будет от полной луны горячо
[89.96s -> 92.68s]  Поверь, я легка
[92.68s -> 97.46s]  Из подземного мира и вверх
[97.46s -> 99.96s]  Поверь, я верю
[99.96s -> 105.14s]  И ты поверь, поверь, поверь
[105.14s -> 117.64s]  На вороньем крыле
[117.64s -> 119.94s]  Не всегда снег
[119.96s -> 121.72s]  Снится ночь
[121.72s -> 124.48s]  Я проваливаюсь в дупло
[124.48s -> 127.36s]  В нору короче к чертям
[127.36s -> 130.96s]  И подземный твой мир
[130.96s -> 134.54s]  Всегда готов мне помочь
[134.54s -> 136.60s]  Только я не всегда
[136.60s -> 139.96s]  К его готова дарам
[139.96s -> 144.88s]  Ведь на чёрных причёрных холмах
[144.88s -> 147.46s]  Созрел виноград
[147.46s -> 149.94s]  И восстали в колхиде
[149.96s -> 153.80s]  Полки драконьих зубов
[153.80s -> 160.40s]  Невозможно в себе хранить этот яд
[160.40s -> 163.82s]  Так открой же в ночи
[163.82s -> 168.90s]  Виноградную драконию кровь
[168.90s -> 173.30s]  Ты мне ворон, ты мне ветер
[173.30s -> 176.24s]  Когда зима придёт
[176.24s -> 179.80s]  Её встреть стыда и беды
[179.80s -> 183.02s]  Песен дай ей пищи
[183.02s -> 187.84s]  Дай же ей всё, чего она ищет
[187.84s -> 190.08s]  Для верхнего мира
[190.08s -> 192.46s]  И горы стальные
[192.46s -> 195.12s]  Рогатые шлемы
[195.12s -> 197.40s]  Феера боевые
[197.40s -> 199.88s]  И кровь дракона
[199.88s -> 202.60s]  И чёрный воздух
[202.60s -> 204.78s]  И эти величиной
[204.78s -> 206.56s]  Скула твои звёзды
[206.56s -> 208.00s]  Во тьме
[208.00s -> 209.68s]  Пишет моя мне
[209.80s -> 211.80s]  Нужна рука
[211.80s -> 213.26s]  И броня
[213.26s -> 215.80s]  Оперенья легка
[215.80s -> 219.56s]  Крепка из подземного мира
[219.56s -> 221.82s]  И вверх, и вверх
[221.82s -> 224.46s]  Поверь, я верю
[224.46s -> 226.66s]  И ты поверь
[226.66s -> 229.34s]  Поверь, я верю
[229.34s -> 231.52s]  И ты поверь
[231.52s -> 234.18s]  Поверь, поверь
[239.80s -> 248.74s]  Изolerantly
[248.74s -> 250.80s]  Познавай себя
[250.80s -> 252.04s]  Слово милости
[252.04s -> 253.84s]  Сияй capturing
[253.84s -> 255.20s]  От коллег
[255.20s -> 256.24s]  И slate
[256.24s -> 258.10s]  Вков ż book
[258.10s -> 259.28s]  М station
[259.28s -> 260.66s]  Борож included
[260.66s -> 261.90s]  Прочтить
[261.90s -> 263.14s]  Девчачий
[263.14s -> 263.92s]  Нырен
[263.92s -> 264.92s]  Аль характер
[264.92s -> 265.76s]  Сильвания
[265.76s -> 266.34s]  Еврон 나오�и
[266.34s -> 267.00s]  Дозв vlog
[267.00s -> 267.80s]  В прямой
[267.80s -> 269.50s]  В истории
[269.80s -> 299.78s]  Субтитры создавал DimaTorzok
finish  Thu Jun 18 18:11:48 2026   481.92256331443787 ~ 8 минут rizen 7 5800H
'''
